<?php
/**
 * アプリケーション独自設定ファイル
 */

// ----------------------------------------------------------------------
// - ヘッダー設定利用マスター情報
// ----------------------------------------------------------------------

$config['ColorInfo'] = array(
    'c' => array(
        'c_01', 'c_02', 'c_03', 'c_04', 'c_05', 'c_06', 'c_07', 'c_08', 'c_09', 'c_10',
        'c_11', 'c_12', 'c_13', 'c_14', 'c_15',
    ),
    'g' => array(
        'g_01', 'g_02', 'g_03', 'g_04', 'g_05', 'g_06', 'g_07', 'g_08', 'g_09', 'g_10',
        'g_11', 'g_12', 'g_13', 'g_14', 'g_15',
    ),
);

// ----------------------------------------------------------------------
// - フッダー設定利用マスター情報
// ----------------------------------------------------------------------

// フッターメニュータイプリスト
$config['FooterMenuTypeList'] = array(
    ''             => __('未使用'),
    'top'          => __('トップ'),
    'news'         => __('ニュース'),
    'menu'         => __('メニュー'),
    'coupon'       => __('クーポン'),
    'setting'      => __('設定'),
    'tel'          => __('電話'),
    'mail'         => __('メール'),
    'map'          => __('地図'),
    'shopprofile'  => __('店舗情報'),
);

// 説明付きアイコンリスト
$config['DescriptionWithIconList'] = array(
    array('description' => __('トップ'),       'icon' => 'A'),
    array('description' => __('セッティング'), 'icon' => 'B'),
    array('description' => __('HTML'),         'icon' => 'C'),
    array('description' => __('クーポン'),     'icon' => 'D'),
    array('description' => __('通知'),         'icon' => 'E'),
    array('description' => __('マップ'),       'icon' => 'F'),
    array('description' => __('メニュー'),     'icon' => 'G'),
    array('description' => __('カート'),       'icon' => 'H'),
    array('description' => __('ショップ'),     'icon' => 'I'),
    array('description' => __('電話'),         'icon' => 'J'),
    array('description' => __('コイン'),       'icon' => 'K'),
    array('description' => __('ニュース'),     'icon' => 'L'),
    array('description' => __('ギャラリー'),   'icon' => 'N'),
    array('description' => __('ユーザー'),     'icon' => 'M'),
    array('description' => __('メール'),       'icon' => 'O'),
    array('description' => __('シェア'),       'icon' => 'P'),
    array('description' => __('通知'),         'icon' => 'Q'),
    array('description' => __('スマホ'),       'icon' => 'R'),
);

// PHPの5.5と5.3の関数互換性対策
if (!function_exists('array_column')) {
    function array_column($iconList, $columnName) {
        $returnList = array();

        foreach($iconList as $info) {
            $returnList[] = $info[$columnName];
        }

        return $returnList;
    }
}

// 説明付きアイコンリストからアイコンだけを抽出
$config['IconList'] = array_column($config['DescriptionWithIconList'], 'icon');


// ----------------------------------------------------------------------
// - 予約カレンダーマスター情報
// ----------------------------------------------------------------------
// 表示非表示
$config['ReserveDisp'] = array(
    1 => __('表示'),
    0 => __('非表示'),
);


// ----------------------------------------------------------------------
// - クーポンマスター情報
// ----------------------------------------------------------------------
$config['ConponTypeList'] = array(
    '0' => __('通常クーポン'),
    '1' => __('期間限定クーポン'),
    '2' => __('使いきりクーポン'),
);

// 表示非表示
$config['CouponDisp'] = array(
    1 => __('表示'),
    0 => __('非表示'),
);

// 期間指定
$config['CouponTermFlg'] = array(
    1 => __('する'),
    0 => __('しない'),
);

// ----------------------------------------------------------------------
// - ブロックマスター情報
// ----------------------------------------------------------------------
// 表示非表示
$config['BlockDisp'] = array(
    0 => __('表示'),
    1 => __('非表示'),
);

// アプリ内リンク
$config['BlockAppLink'] = array(
    'menu' => __('メニュー'),
    'coupon' => __('クーポン'),
    'news' => __('ニュース'),
);

// メニューの有効ステータス
$config['MenuEnableStatus'] = array(
    'enable' => 1,
    'disable' => 0,
    );

// マージン設定
$config['MarginSetting'] = array(
    10 => __('狭い'),
    20 => __('普通'),
    30 => __('広い'),
);

// ----------------------------------------------------------------------
// - サイドメニューマスター情報
// ----------------------------------------------------------------------
$config['SidemenuDisp'] = array(
    1 => __('表示'),
    0 => __('非表示'),
);



// ----------------------------------------------------------------------
// - 店舗情報設定利用マスター情報
// ----------------------------------------------------------------------

/**
 * 都道府県一覧を取得します。
 */
$config['PrefList'] = array(
    ''   => __('都道府県を選択'),
    '1'  => __('北海道'),
    '2'  => __('青森県'),
    '3'  => __('岩手県'),
    '4'  => __('宮城県'),
    '5'  => __('秋田県'),
    '6'  => __('山形県'),
    '7'  => __('福島県'),
    '8'  => __('茨城県'),
    '9'  => __('栃木県'),
    '10' => __('群馬県'),
    '11' => __('埼玉県'),
    '12' => __('千葉県'),
    '13' => __('東京都'),
    '14' => __('神奈川県'),
    '15' => __('新潟県'),
    '16' => __('富山県'),
    '17' => __('石川県'),
    '18' => __('福井県'),
    '19' => __('山梨県'),
    '20' => __('長野県'),
    '21' => __('岐阜県'),
    '22' => __('静岡県'),
    '23' => __('愛知県'),
    '24' => __('三重県'),
    '25' => __('滋賀県'),
    '26' => __('京都府'),
    '27' => __('大阪府'),
    '28' => __('兵庫県'),
    '29' => __('奈良県'),
    '30' => __('和歌山県'),
    '31' => __('鳥取県'),
    '32' => __('島根県'),
    '33' => __('岡山県'),
    '34' => __('広島県'),
    '35' => __('山口県'),
    '36' => __('徳島県'),
    '37' => __('香川県'),
    '38' => __('愛媛県'),
    '39' => __('高知県'),
    '40' => __('福岡県'),
    '41' => __('佐賀県'),
    '42' => __('長崎県'),
    '43' => __('熊本県'),
    '44' => __('大分県'),
    '45' => __('宮崎県'),
    '46' => __('鹿児島県'),
    '47' => __('沖縄県'),
);


// ----------------------------------------------------------------------
// - クーポン種類設定値
// ----------------------------------------------------------------------
$config['CouponTypeList'] = array(
    ''             => __('未使用'),
    'top'          => __('トップ'),
    'news'         => __('ニュース'),
);



// ======================================================================
// = 初期設定値
// ======================================================================

// ----------------------------------------------------------------------
// - ショップステータス初期設定値
// ----------------------------------------------------------------------

$config['shop_status_info'] = array(
    'status' => '100',
    'expired' => '',
);

// ----------------------------------------------------------------------
// - ストア初期設定値
// ----------------------------------------------------------------------

$config['store_info'] = array(
    'image' => array(
        'icon' => '', // アプリアイコン
        'publicity' => '', // GooglePlay宣伝用画像
    ),
    'text' => array( // 文字情報
        'app_name' => '', // アプリ名
        'store_name' => '', // ストアでの表示名
        'description' => '', // ストア説明文
        'keyword' => '', // AppStoreキーワード
    ),
    'category' => array( // カテゴリー
        'apple1' => '', // AppStore主カテゴリー
        'apple2' => '', // AppleStore副カテゴリー
        'android' => '', // AndroidPlayカテゴリー
    ),
    'url' => array( // アプリURL
        'apple' => '', // AppStoreアプリのURL
        'google' => '', // GooglePlayアプリのURL
    ),
);

// ----------------------------------------------------------------------
// - ヘッダー初期設定値
// ----------------------------------------------------------------------

// {"header":{"color":"","image":""}}
$config['header_info'] = array(
    'header' => array(
        'image' => '',
        'color' => 'c_01',
    ),
);

// ----------------------------------------------------------------------
// - フッダー初期設定値
// ----------------------------------------------------------------------

$config['footer_info'] = array(
    array('type' => '', 'icon' => ''),
    array('type' => '', 'icon' => ''),
    array('type' => '', 'icon' => ''),
    array('type' => '', 'icon' => ''),
    array('type' => '', 'icon' => ''),
);

// ----------------------------------------------------------------------
// - サイドメニュー初期設定値
// ----------------------------------------------------------------------

$config['side_info'] = array(
    array('name' => __('トップ'), 'key' => 'top', 'file_name' => 'A', 'enable' => '1', 'position' => '1'),
    array('name' => __('ニュース'), 'key' => 'news', 'file_name' => 'L', 'enable' => '1', 'position' => '2'),
    array('name' => __('メニュー'), 'key' => 'menu', 'file_name' => 'G', 'enable' => '1', 'position' => '3'),
    array('name' => __('クーポン'), 'key' => 'coupon', 'file_name' => 'D', 'enable' => '1', 'position' => '4'),
    array('name' => __('店舗情報'), 'key' => 'shopprofile', 'file_name' => 'I', 'enable' => '1', 'position' => '5'),
    array('name' => __('セッティング'), 'key' => 'setting', 'file_name' => 'B', 'enable' => '1', 'position' => '6'),
    array('name' => __('電話する'), 'key' => 'tel', 'file_name' => 'J', 'enable' => '1', 'position' => '7'),
    array('name' => __('メールする'), 'key' => 'mail', 'file_name' => 'O', 'enable' => '1', 'position' => '8'),
    array('name' => __('マップ'), 'key' => 'map', 'file_name' => 'F', 'enable' => '1', 'position' => '9'),
);

// ----------------------------------------------------------------------
// - 背景初期設定値
// ----------------------------------------------------------------------

// {"background":{"color":"","image":""}}
$config['background_info'] = array(
    'background' => array(
        'image' => '',
        'color' => 'c_01',
    ),
);

// ----------------------------------------------------------------------
// - スプラッシュ初期設定値
// ----------------------------------------------------------------------

// {"splash":{"image":"","movie":""}}
$config['splash_info'] = array(
    'splash' => array(
        'image' => '',
        'movie' => '',
    ),
);

// ----------------------------------------------------------------------
// - 店舗情報初期設定値
// ----------------------------------------------------------------------

$config['shop_info'] = array(
    'image' => '',
    'profile' => array(
        'shop_name'   => '',
        'zip_code1'   => '',
        'zip_code2'   => '',
        'tel1'         => '',
        'tel2'         => '',
        'tel3'         => '',
        'fax1'         => '',
        'fax2'         => '',
        'fax3'         => '',
        'address'     => '',
        'email'       => '',
        'url'         => '',
        'online_shop' => '',
        'open_hours'  => '',
        'holiday'     => '',
    ),
);

$config['web_info'] = array(
    'html'       => '',
    'css'        => '',
    'image_list' => array(),
);

// ----------------------------------------------------------------------
// - 予約カレンダー初期設定値
// ----------------------------------------------------------------------
require_once('reserveDefaultMail.php');
require_once('reserveDefaultUsage.php');
$config['reserve_info'] = array(
    'enable' => '0',
    'rule_body' => $reserveDefaultUsage,
    'mail_body'  => $reserveDefaultMail,
    'email' => '',
    'tel1' => '',
    'tel2' => '',
    'tel3' => '',
);

$config['news_list'] = array(
    'list' => array(),
);

$config['news_info'] = array(
    'use_media' => '0',
    'media'     => '',
    'title'     => '',
    'body'      => '',
    'push'      => '',
    'delivery'  => '',
    'date'      => '',
    'hour'      => '',
    'minute'    => '',
);

// ----------------------------------------------------------------------
// - サイドメニュー初期設定値
// ----------------------------------------------------------------------
$config['sidemenu_info'] = array(
    'top' => array('enable' => 1, 'name' => __('トップ'), 'icon' => 'A'),
    'news' => array('enable' => 1, 'name' => __('ニュース'), 'icon' => 'L'),
    'menu' => array('enable' => 1, 'name' => __('メニュー'), 'icon' => 'G'),
    'coupon' => array('enable' => 1, 'name' => __('クーポン'), 'icon' => 'D'),
    'shopprofile' => array('enable' => 1, 'name' => __('店舗情報'), 'icon' => 'I'),
    'setting' => array('enable' => 1, 'name' => __('セッティング'), 'icon' => 'B'),
    'tel' => array('enable' => 1, 'name' => __('電話する'), 'icon' => 'J'),
    'mail' => array('enable' => 1, 'name' => __('メールする'), 'icon' => 'O'),
    'map' => array('enable' => 1, 'name' => __('マップ'), 'icon' => 'F'),
    );


// ----------------------------------------------------------------------
// - クーポン初期設定値
// ----------------------------------------------------------------------
$config['coupon_info'] = array(
    array('image' => '', 'enable_flg' => '', 'title' => '', 'policy' => '', 'coupon_type' =>'', 'term_flg' => '0', 'discount' => '', 'display_days' => '', 'start_datetime' => '', 'end_datetime' => '', 'hash' => ''),
    array('image' => '', 'enable_flg' => '', 'title' => '', 'policy' => '', 'coupon_type' =>'', 'term_flg' => '0', 'discount' => '', 'display_days' => '', 'start_datetime' => '', 'end_datetime' => '', 'hash' => ''),
    array('image' => '', 'enable_flg' => '', 'title' => '', 'policy' => '', 'coupon_type' =>'', 'term_flg' => '0', 'discount' => '', 'display_days' => '', 'start_datetime' => '', 'end_datetime' => '', 'hash' => ''),
    array('image' => '', 'enable_flg' => '', 'title' => '', 'policy' => '', 'coupon_type' =>'', 'term_flg' => '0', 'discount' => '', 'display_days' => '', 'start_datetime' => '', 'end_datetime' => '', 'hash' => ''),
    array('image' => '', 'enable_flg' => '', 'title' => '', 'policy' => '', 'coupon_type' =>'', 'term_flg' => '0', 'discount' => '', 'display_days' => '', 'start_datetime' => '', 'end_datetime' => '', 'hash' => ''),
    );

// ----------------------------------------------------------------------
// - アプリ申請 初期値
// ----------------------------------------------------------------------
$config['apply_info'] = array(
    'app_icon' => '',
    'app_init_image' => '',
    'app_ad_image' => '',
    'store_info' => array(
        'app_name' => '',
        'app_disp_name' => '',
        'description' => '',
        ),
    'store_category_info' => array(
        'category_iphone1' => __('未選択'),
        'category_iphone2' => __('未選択'),
        'category_android' => __('未選択'),
        ),
    'keyword' => '',
    'screenshot_learge' => array(
        'screenshot_learge_1' => '',
        'screenshot_learge_2' => '',
        'screenshot_learge_3' => '',
        'screenshot_learge_4' => '',
        'screenshot_learge_5' => '',
        ),
    'screenshot_small' => array(
        'screenshot_small_1' => '',
        'screenshot_small_2' => '',
        'screenshot_small_3' => '',
        'screenshot_small_4' => '',
        'screenshot_small_5' => '',
        ),
    );

// ----------------------------------------------------------------------
// - ブロック初期設定値
// ----------------------------------------------------------------------
$config['block_info'] = array(
    'image' => array('del' => 0, 'images' => array(
            array(
                'image_type' => '0', // 0:未設定 1:画像 3:youtube
                'image' => '', // イメージのID
                'youtube' => '', // youtubeID
                'link_type' => '0', // 0:設定ない 1:url指定 2:アプリ内リンク
                'url' => '', // リンク先
                'link_app' => '', // アプリ内リンク先
                'date' => '-', // 更新日付
            ),
            array(
                'image_type' => '0', // 0:未設定 1:画像 3:youtube
                'image' => '', // イメージのID
                'youtube' => '', // youtubeID
                'link_type' => '0', // 0:設定ない 1:url指定 2:アプリ内リンク
                'url' => '', // リンク先
                'link_app' => '', // アプリ内リンク先
                'date' => '-', // 更新日付
            ),
            array(
                'image_type' => '0', // 0:未設定 1:画像 3:youtube
                'image' => '', // イメージのID
                'youtube' => '', // youtubeID
                'link_type' => '0', // 0:設定ない 1:url指定 2:アプリ内リンク
                'url' => '', // リンク先
                'link_app' => '', // アプリ内リンク先
                'date' => '-', // 更新日付
            ),
            array(
                'image_type' => '0', // 0:未設定 1:画像 3:youtube
                'image' => '', // イメージのID
                'youtube' => '', // youtubeID
                'link_type' => '0', // 0:設定ない 1:url指定 2:アプリ内リンク
                'url' => '', // リンク先
                'link_app' => '', // アプリ内リンク先
                'date' => '-', // 更新日付
            ),
            array(
                'image_type' => '0', // 0:未設定 1:画像 3:youtube
                'image' => '', // イメージのID
                'youtube' => '', // youtubeID
                'link_type' => '0', // 0:設定ない 1:url指定 2:アプリ内リンク
                'url' => '', // リンク先
                'link_app' => '', // アプリ内リンク先
                'date' => '-', // 更新日付
            ),
        ),
    ),
    'topic' => array('del' => 0, 'message' => ''),
    'news' => array('del' => 0),
    'menu' => array('del' => 0, 'menus' => array( // からのメニューが5つ。
        '',
        '',
        '',
        '',
        '',
        ),
    ),
    'map' => array('del' => 0),
    'coupon' => array('del' => 0),
    'webview' => array('del' => 0, 'url' => ''),
    'sns' => array('del' => 0, 'snsinfo' => array('sns_1' => '','sns_2' => '','sns_3' => '','sns_4' => '','sns_5' => '')),
    'tel' => array('del' => 0),
    'cms' => array('del' => 0, 'height' => '640'),
    'margin' => array('del' => 0, 'margin' => '10')
);

// ----------------------------------------------------------------------
// - ニュース設定
// ----------------------------------------------------------------------
// ニュースの配信日時設定
$config['news_time_list'] = array(
    'hour' => array(
        '' => __('時の選択'),
        '00' => '00',
        '01' => '01',
        '02' => '02',
        '03' => '03',
        '04' => '04',
        '05' => '05',
        '06' => '06',
        '07' => '07',
        '08' => '08',
        '09' => '09',
        '10' => '10',
        '11' => '11',
        '12' => '12',
        '13' => '13',
        '14' => '14',
        '15' => '15',
        '16' => '16',
        '17' => '17',
        '18' => '18',
        '19' => '19',
        '20' => '20',
        '21' => '21',
        '22' => '22',
        '23' => '23',
        ),
    'min' => array(
        '' => __('分の選択'),
        '00' => '00',
        '10' => '10',
        '20' => '20',
        '30' => '30',
        '40' => '40',
        '50' => '50',
        ),
);

// プッシュするかしないか
$config['news_push'] = array(
    1 => __('する'),
    0 => __('しない'),
);


// ----------------------------------------------------------------------
// - HTML 初期値
// ----------------------------------------------------------------------
require_once('htmldefault.php');
require_once('htmldefaultcss.php');
$config['html_info'] = array(
    'html' => $htmlDefault,
    'image' => array(),
    'css' => $cssDefault,
);


// ----------------------------------------------------------------------
// - 画像リサイズ設定
// ----------------------------------------------------------------------
$config['resize_info'] = array(
    'normal' => array( // ふつうのリサイズ //メニュー系画像
        'width' => 640,
        'height' => 360,
        ),
    'coupon' => array( // クーポン専用
        'width' => 640,
        'height' => 814,
        ),
    'news' => array( // ニュース専用。きりぬきなし
        'width' => 640,
        'height' => null
        ),
    'header' => array( // ヘッダ専用
        'width' => 400,
        'height' => 66,
        ),
    'fullsize' => array( // 背景とか、スプラッシュとか画面全体
        'width' => 640,
        'height' => 1136,
        ),
    'icon' => array( // アプリ申請のアイコン
        'width' => 1024,
        'height' => 1024,
        ),
    'adIcon' => array( // アプリ申請　宣伝用のアイコン
        'width' => 1024,
        'height' => 500,
        ),
);

// ----------------------------------------------------------------------
// - アプリ申請マスター
// ----------------------------------------------------------------------
// iphone用のカテゴリ
$config['applyCategory_iphone'] = array(
    '' => __('--- カテゴリー選択 ---'),
    'エンターテイメント' => __('エンターテイメント'),
    'カタログ' => __('カタログ'),
    '教育' => __('教育'),
    'ゲーム' => __('ゲーム'),
    '仕事効率化' => __('仕事効率化'),
    '辞書／辞典／その他' => __('辞書／辞典／その他'),
    '写真／ビデオ' => __('写真／ビデオ'),
    'スポーツ' => __('スポーツ'),
    'ソーシャルネットワーキング' => __('ソーシャルネットワーキング'),
    '天気' => __('天気'),
    'ナビゲーション' => __('ナビゲーション'),
    'ニュース' => __('ニュース'),
    'ビジネス' => __('ビジネス'),
    'ファイナンス' => __('ファイナンス'),
    'BOOK' => __('BOOK'),
    'ヘルスケア／フィットネス' => __('ヘルスケア／フィットネス'),
    'ミュージック' => __('ミュージック'),
    'メディカル' => __('メディカル'),
    'ユーティリティ' => __('ユーティリティ'),
    'ライフスタイル' => __('ライフスタイル'),
    '旅行' => __('旅行'),
    'フード／ドリンク' => __('フード／ドリンク'),
);

// android用のカテゴリ
$config['applyCategory_android'] = array(
    '' => __('--- カテゴリー選択 ---'),
    'エンタテイメント' => __('エンタテイメント'),
    'カスタマイズ' => __('カスタマイズ'),
    'コミック' => __('コミック'),
    'ショッピング' => __('ショッピング'),
    'スポーツ' => __('スポーツ'),
    'ソーシャル' => __('ソーシャル'),
    'ツール' => __('ツール'),
    'ニュース＆雑誌' => __('ニュース＆雑誌'),
    'ビジネス' => __('ビジネス'),
    'ファイナンス' => __('ファイナンス'),
    'メディア＆動画' => __('メディア＆動画'),
    'ライフスタイル' => __('ライフスタイル'),
    'ライブラリ＆デモ' => __('ライブラリ＆デモ'),
    '医療' => __('医療'),
    '音楽＆オーディオ' => __('音楽＆オーディオ'),
    '教育' => __('教育'),
    '健康＆フィットネス' => __('健康＆フィットネス'),
    '交通' => __('交通'),
    '仕事効率化' => __('仕事効率化'),
    '写真' => __('写真'),
    '書籍＆文献' => __('書籍＆文献'),
    '通信' => __('通信'),
    '天気' => __('天気'),
    '旅行＆地域' => __('旅行＆地域'),
);