<?php
/**
 * アプリケーション独自設定ファイル
 */

// ----------------------------------------------------------------------
// - 国名
// ----------------------------------------------------------------------
$config['flag_name'] = array(
    'ja' => 'Japanese', //Japanese
    'en' => 'English', //English
    'vi' => 'Vietnamese', //Vietnamese
    'zh' => 'Chines', //Chines
);


// ----------------------------------------------------------------------
// - リジェクト種類マスター情報
// ----------------------------------------------------------------------
$config['InspectRejectType'] = array(
    '' => __('リジェクト理由を選択'),
    '1' => __('お店の画像未登録'), // お店の画像が登録されていません。
    '2' => __('お店の情報の不備'), // お店の情報の登録内容に不備があります。
    '3' => __('アプリアイコンの不備'), // アプリケーション用アイコンが登録されていませんでした。
    '4' => __('メニューカテゴリー不足'), // カテゴリー、又は商品の項目数が不足しております。
    '5' => __('クーポン情報の不足'), // クーポン情報の内容が不足しております。
    '6' => __('全体的なコンテンツ不足'), // コンテンツ内容が、全体的に不足しております。
    '7' => __('アプリ内容の変更'), // アプリ再作成をお願いします。
    '8' => __('スクリーンショット画像の不備'), // アプリの内容を示すスクリーンショットではありません。
    '9' => __('フッターアイコンの不備'), // フッターアイコンが適切ではありません。
);

$config['InspectRejectAppleType'] = array(
    '' => __('リジェクト理由を選択'),
    '1' => __('著作権を含むコンテンツ'), // 著作権のあるコンテンツは申請時に著作権オーナーとの契約を提示する必要があります。
    '2' => __('アプリ内設置URL先ページがスマホ未対応'), // アプリ内に設置したURLリンク先がスマホ対応していません。
    '3' => __('コンテンツがネガティブ'), // コンテンツが過度にネガティブであり、ユーザー心理に悪影響を及ぼす可能性があります。
    '4' => __('クーポン情報の不足'), // クーポン情報の内容が不足しております。
    '5' => __('コンテンツ不足'), // コンテンツの内容が不足しております。
    '6' => __('使用画像の不備'), // 使用されている画像の一部に不備があります。
);

// ----------------------------------------------------------------------
// - 公開状態設定利用マスター情報
// ----------------------------------------------------------------------

$config['ShopStatusInfo'] = array(
    '100' => __('初期ステータス'),
    '200' => __('審査申請中'),
    '300' => __('審査通過済'),
    '400' => __('弊社公開処理待ち'),
    '500' => __('公開中'),
    '600' => __('アカウント停止'),
    '700' => __('一時停止'),
    '800' => __('有効期限切れ'),
    '900' => __('退会'),
);

// ----------------------------------------------------------------------
// - 申請状況設定利用マスター情報
// ----------------------------------------------------------------------
$config['AgentInspectStatusInfo'] = array(
    '' => __('審査リクエスト'),
    '0' => __('簡易審査リジェクト'),
    '1' => __('簡易審査終了'),
);
$config['InspectStatusInfo'] = array(
    '0' => __('初期 or 簡易審査リジェクト'),
    '1' => __('申請受付'),
    '2' => __('簡易審査中'),
    '3' => __('簡易審査終了'),
    '4' => __('Androidリリース完了'),
    '5' => __('Apple審査申請受付'),
    '6' => __('Apple審査申請完了（※Apple審査中）'),
    '7' => __('Apple審査リジェクト'),
    '8' => __('Apple審査通過'),
    '9' => __('iOSリリース完了'),
);

// ----------------------------------------------------------------------
// - ヘッダー設定利用マスター情報
// ----------------------------------------------------------------------

$config['ColorInfo'] = array(
	'c' => array(
		'c_01', 'c_02', 'c_03', 'c_04', 'c_05', 'c_06', 'c_07', 'c_08', 'c_09', 'c_10',
		'c_11', 'c_12', 'c_13', 'c_14', 'c_15',
	),
	'g' => array(
		'g_01', 'g_02', 'g_03', 'g_04', 'g_05', 'g_06', 'g_07', 'g_08', 'g_09', 'g_10',
		'g_11', 'g_12', 'g_13', 'g_14', 'g_15',
	),
);

// ----------------------------------------------------------------------
// - フッダー設定利用マスター情報
// ----------------------------------------------------------------------

// フッターメニュータイプリスト
$config['FooterMenuTypeList'] = array(
    ''            => __('未使用'),
    'top'         => __('トップ'),
    'news'        => __('ニュース'),
    'menu'        => __('メニュー'),
    'coupon'      => __('クーポン'),
    'setting'     => __('設定'),
    'tel'         => __('電話'),
    'mail'        => __('メール'),
    'map'         => __('地図'),
    'shopprofile' => __('店舗情報'),
);


// ----------------------------------------------------------------------
// - 店舗情報設定利用マスター情報
// ----------------------------------------------------------------------

/**
 * 都道府県一覧を取得します。
 */
$config['PrefList'] = array(
    ''   => __('都道府県を選択'),
    '1'  => __('北海道'),
    '2'  => __('青森県'),
    '3'  => __('岩手県'),
    '4'  => __('宮城県'),
    '5'  => __('秋田県'),
    '6'  => __('山形県'),
    '7'  => __('福島県'),
    '8'  => __('茨城県'),
    '9'  => __('栃木県'),
    '10' => __('群馬県'),
    '11' => __('埼玉県'),
    '12' => __('千葉県'),
    '13' => __('東京都'),
    '14' => __('神奈川県'),
    '15' => __('新潟県'),
    '16' => __('富山県'),
    '17' => __('石川県'),
    '18' => __('福井県'),
    '19' => __('山梨県'),
    '20' => __('長野県'),
    '21' => __('岐阜県'),
    '22' => __('静岡県'),
    '23' => __('愛知県'),
    '24' => __('三重県'),
    '25' => __('滋賀県'),
    '26' => __('京都府'),
    '27' => __('大阪府'),
    '28' => __('兵庫県'),
    '29' => __('奈良県'),
    '30' => __('和歌山県'),
    '31' => __('鳥取県'),
    '32' => __('島根県'),
    '33' => __('岡山県'),
    '34' => __('広島県'),
    '35' => __('山口県'),
    '36' => __('徳島県'),
    '37' => __('香川県'),
    '38' => __('愛媛県'),
    '39' => __('高知県'),
    '40' => __('福岡県'),
    '41' => __('佐賀県'),
    '42' => __('長崎県'),
    '43' => __('熊本県'),
    '44' => __('大分県'),
    '45' => __('宮崎県'),
    '46' => __('鹿児島県'),
    '47' => __('沖縄県'),
);



// ======================================================================
// = 初期設定値
// ======================================================================

// ----------------------------------------------------------------------
// - ショップステータス初期設定値
// ----------------------------------------------------------------------

$config['shop_status_info'] = array(
    'status' => '100',
    'expired' => '',
);

// ----------------------------------------------------------------------
// - ストア初期設定値
// ----------------------------------------------------------------------

$config['store_info'] = array(
    'image' => array( // 画像ファイル
        'icon' => '', // アプリアイコン
        'publicity' => '', // GooglePlay宣伝用画像
    ),
    'text' => array( // 文字情報
        'app_name' => '', // アプリ名
        'store_name' => '', // ストアでの表示名
        'description' => '', // ストア説明文
        'keyword' => '', // AppStoreキーワード
    ),
    'category' => array( // カテゴリー
        'apple1' => '', // AppStore主カテゴリー
        'apple2' => '', // AppleStore副カテゴリー
        'android' => '', // AndroidPlayカテゴリー
    ),
    'url' => array( // アプリURL
        'apple' => '', // AppStoreアプリのURL
        'google' => '', // GooglePlayアプリのURL
    ),
);

// ----------------------------------------------------------------------
// - ヘッダー初期設定値
// ----------------------------------------------------------------------

// {"header":{"color":"","image":""}}
$config['header_info'] = array(
	'header' => array(
		'image' => '',
		'color' => '',
	),
);

// ----------------------------------------------------------------------
// - フッダー初期設定値
// ----------------------------------------------------------------------

$config['footer_info'] = array(
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
);

// ----------------------------------------------------------------------
// - 背景初期設定値
// ----------------------------------------------------------------------

// {"background":{"color":"","image":""}}
$config['background_info'] = array(
	'background' => array(
		'image' => '',
		'color' => '',
	),
);

// ----------------------------------------------------------------------
// - スプラッシュ初期設定値
// ----------------------------------------------------------------------

// {"splash":{"image":"","movie":""}}
$config['splash_info'] = array(
	'splash' => array(
		'image' => '',
		'movie' => '',
	),
);

// ----------------------------------------------------------------------
// - 店舗情報初期設定値
// ----------------------------------------------------------------------

$config['shop_info'] = array(
	'image' => '',
	'profile' => array(
		'shop_name'   => '',
		'zip_code1'   => '',
		'zip_code2'   => '',
		'tel'         => '',
		'fax'         => '',
        'address'     => '',
		'email'       => '',
		'url'         => '',
		'online_shop' => '',
		'open_hours'  => '',
		'holiday'     => '',
	),
);

$config['web_info'] = array(
	'html'       => '',
	'css'        => '',
	'image_list' => array(),
);

// ----------------------------------------------------------------------
// - 予約カレンダー初期設定値
// ----------------------------------------------------------------------

$config['reservation_calendar'] = array(
	'use'        => '0',
	'use_method' => '',
	'mail_body'  => '',
	'contact'    => array(
		'tel1'      => '',
		'tel2'      => '',
		'tel3'      => '',
		'email'     => '',
	),
);

$config['news_list'] = array(
	'list' => array(),
);

$config['news_info'] = array(
	'use_media' => '0',
	'media'     => '',
	'title'     => '',
	'body'      => '',
	'push'      => '',
	'delivery'  => '',
	'date'      => '',
	'hour'      => '',
	'minute'    => '',
);

