<?php echo $user_name;?> 先生/小姐

一直得到你的關照。
我們是iPost HK營運事務所。

感謝你申請iPost HKApp程式審核。
以下為審核結果。

■審核結果
審核NG

■審核NG理由
<?php echo $title;?>


<?php echo $body;?>


以上的理由、故不能通過審核。
為你增添麻煩深感抱歉、
請再次從審核申請頁往[App程式審核申請]。

※審核需要日數
現正有多項審核申請、故審核需多花一點時間。
讓你等候深感抱歉。
我們會以最快的速度去對應、敬請多多包涵。

//////////////////////////////////////////////////

<?php echo $user_name;?>　様

いつもお世話になっております。
iPost運営事務局でございます。

この度はiPostアプリ審査の申請をいただきまして誠に有難うございます。
審査の結果を以下にお伝え致します。


■審査結果
審査NG

■審査NG理由
<?php echo $title;?>


<?php echo $body;?>


上記の理由により、審査を通過しませんでした。
つきましては誠にお手数とは存じますが、ご対応いただいた上、
再度アプリ審査の申請してくださいます様をお願い申し上げます。

※審査に要する日数について
お陰様で只今、多数の審査申請をいただいておりまして審査に時間が掛かっている状態でございます。
お客様に於かれましてはお待たせすることとなり誠に申し訳ございません。
出来る限り迅速な対応を心掛けてまいりますので何卒ご容赦の程、お願い申し上げます。

ご不明な点などございましたら、下記までご遠慮なくお問い合わせくださいませ。
今後とも何卒宜しくお願い申し上げます。
