<?php
/**
 * アプリケーション独自設定ファイル
 */

// ----------------------------------------------------------------------
// - 公開状態設定利用マスター情報
// ----------------------------------------------------------------------

$config['ShopStatusInfo'] = array(
    '100' => '初期ステータス',
    '200' => '審査申請中',
    '300' => '審査通過済',
    '400' => '弊社公開処理待ち',
    '500' => '公開中',
    '600' => 'アカウント停止',
    '700' => '一時停止',
    '800' => '有効期限切れ',
    '900' => '退会',
);

// ----------------------------------------------------------------------
// - 申請状況設定利用マスター情報
// ----------------------------------------------------------------------

$config['InspectStatusInfo'] = array(
    '0' => '初期 or 簡易審査リジェクト',
    '1' => '申請受付',
    '2' => '簡易審査中',
    '3' => '簡易審査終了',
    '4' => 'Androidリリース完了',
    '5' => 'Apple審査申請受付',
    '6' => 'Apple審査申請完了（※Apple審査中）',
    '7' => 'Apple審査リジェクト',
    '8' => 'Apple審査通過',
    '9' => 'iOSリリース完了',
);

// ----------------------------------------------------------------------
// - ヘッダー設定利用マスター情報
// ----------------------------------------------------------------------

$config['ColorInfo'] = array(
	'c' => array(
		'c_01', 'c_02', 'c_03', 'c_04', 'c_05', 'c_06', 'c_07', 'c_08', 'c_09', 'c_10',
		'c_11', 'c_12', 'c_13', 'c_14', 'c_15',
	),
	'g' => array(
		'g_01', 'g_02', 'g_03', 'g_04', 'g_05', 'g_06', 'g_07', 'g_08', 'g_09', 'g_10',
		'g_11', 'g_12', 'g_13', 'g_14', 'g_15',
	),
);

// ----------------------------------------------------------------------
// - フッダー設定利用マスター情報
// ----------------------------------------------------------------------

// フッターメニュータイプリスト
$config['FooterMenuTypeList'] = array(
    ''             => '未使用',
    'top'          => 'トップ',
    'news'         => 'ニュース',
    'menu'         => 'メニュー',
    'coupon'       => 'クーポン',
    'setting'      => '設定',
    'tel'          => '電話',
    'mail'         => 'メール',
    'map'          => '地図',
    'shopprofile'  => '店舗情報',
);

// ----------------------------------------------------------------------
// - 店舗情報設定利用マスター情報
// ----------------------------------------------------------------------

/**
 * 都道府県一覧を取得します。
 */
$config['PrefList'] = array(
	''   => '都道府県を選択',
	'1'  => '北海道',
	'2'  => '青森県',
	'3'  => '岩手県',
	'4'  => '宮城県',
	'5'  => '秋田県',
	'6'  => '山形県',
	'7'  => '福島県',
	'8'  => '茨城県',
	'9'  => '栃木県',
	'10' => '群馬県',
	'11' => '埼玉県',
	'12' => '千葉県',
	'13' => '東京都',
	'14' => '神奈川県',
	'15' => '新潟県',
	'16' => '富山県',
	'17' => '石川県',
	'18' => '福井県',
	'19' => '山梨県',
	'20' => '長野県',
	'21' => '岐阜県',
	'22' => '静岡県',
	'23' => '愛知県',
	'24' => '三重県',
	'25' => '滋賀県',
	'26' => '京都府',
	'27' => '大阪府',
	'28' => '兵庫県',
	'29' => '奈良県',
	'30' => '和歌山県',
	'31' => '鳥取県',
	'32' => '島根県',
	'33' => '岡山県',
	'34' => '広島県',
	'35' => '山口県',
	'36' => '徳島県',
	'37' => '香川県',
	'38' => '愛媛県',
	'39' => '高知県',
	'40' => '福岡県',
	'41' => '佐賀県',
	'42' => '長崎県',
	'43' => '熊本県',
	'44' => '大分県',
	'45' => '宮崎県',
	'46' => '鹿児島県',
	'47' => '沖縄県',
);



// ======================================================================
// = 初期設定値
// ======================================================================

// ----------------------------------------------------------------------
// - ショップステータス初期設定値
// ----------------------------------------------------------------------

$config['shop_status_info'] = array(
    'status' => '100',
    'expired' => '',
);

// ----------------------------------------------------------------------
// - ストア初期設定値
// ----------------------------------------------------------------------

$config['store_info'] = array(
    'image' => array( // 画像ファイル
        'icon' => '', // アプリアイコン
        'publicity' => '', // GooglePlay宣伝用画像
    ),
    'text' => array( // 文字情報
        'app_name' => '', // アプリ名
        'store_name' => '', // ストアでの表示名
        'description' => '', // ストア説明文
        'keyword' => '', // AppStoreキーワード
    ),
    'category' => array( // カテゴリー
        'apple1' => '', // AppStore主カテゴリー
        'apple2' => '', // AppleStore副カテゴリー
        'android' => '', // AndroidPlayカテゴリー
    ),
    'url' => array( // アプリURL
        'apple' => '', // AppStoreアプリのURL
        'google' => '', // GooglePlayアプリのURL
    ),
);

// ----------------------------------------------------------------------
// - ヘッダー初期設定値
// ----------------------------------------------------------------------

// {"header":{"color":"","image":""}}
$config['header_info'] = array(
	'header' => array(
		'image' => '',
		'color' => '',
	),
);

// ----------------------------------------------------------------------
// - フッダー初期設定値
// ----------------------------------------------------------------------

$config['footer_info'] = array(
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
	array('type' => '', 'icon' => ''),
);

// ----------------------------------------------------------------------
// - 背景初期設定値
// ----------------------------------------------------------------------

// {"background":{"color":"","image":""}}
$config['background_info'] = array(
	'background' => array(
		'image' => '',
		'color' => '',
	),
);

// ----------------------------------------------------------------------
// - スプラッシュ初期設定値
// ----------------------------------------------------------------------

// {"splash":{"image":"","movie":""}}
$config['splash_info'] = array(
	'splash' => array(
		'image' => '',
		'movie' => '',
	),
);

// ----------------------------------------------------------------------
// - 店舗情報初期設定値
// ----------------------------------------------------------------------

$config['shop_info'] = array(
	'image' => '',
	'profile' => array(
		'shop_name'   => '',
		'zip_code1'   => '',
		'zip_code2'   => '',
		'tel'         => '',
		'fax'         => '',
		'email'       => '',
		'url'         => '',
		'online_shop' => '',
		'open_hours'  => '',
		'holiday'     => '',
	),
);

$config['web_info'] = array(
	'html'       => '',
	'css'        => '',
	'image_list' => array(),
);

// ----------------------------------------------------------------------
// - 予約カレンダー初期設定値
// ----------------------------------------------------------------------

$config['reservation_calendar'] = array(
	'use'        => '0',
	'use_method' => '',
	'mail_body'  => '',
	'contact'    => array(
		'tel1'      => '',
		'tel2'      => '',
		'tel3'      => '',
		'email'     => '',
	),
);

$config['news_list'] = array(
	'list' => array(),
);

$config['news_info'] = array(
	'use_media' => '0',
	'media'     => '',
	'title'     => '',
	'body'      => '',
	'push'      => '',
	'delivery'  => '',
	'date'      => '',
	'hour'      => '',
	'minute'    => '',
);

